{
  "backend/main.mo": "Motoko actor providing HTTP outcall functions to fetch external IP address, measure ping latency, retrieve geo-location info, and test download speed using multiple fallback API endpoints.",
  "feature_evidence.json": "Feature evidence report documenting the satellite map column expansion feature (90% width on click) with references to App.tsx and associated components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their roles in the three-column GPS tracking application with satellite map visualization.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode color tokens for the igo satellite tracking theme.",
  "frontend/index.html": "HTML entry point with mobile-optimized meta tags and viewport settings for the igo live location tracking application.",
  "frontend/src/App.tsx": "Main React component implementing a three-column collapsible layout with GPS tracking, trail visualization, distance calculation, and special 90/5/5 width distribution when satellite map column is expanded.",
  "frontend/src/components/CoordinateDisplay.tsx": "Component displaying GPS coordinates, accuracy quality badges, movement metrics (speed/heading), and total distance traveled in a stacked card layout.",
  "frontend/src/components/DeviceInfoDialog.tsx": "Empty file placeholder for device information dialog component.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright year, heart icon, and UTM-tracked link to caffeine.ai using the app's hostname.",
  "frontend/src/components/Header.tsx": "Sticky header with satellite icon and igo branding, responsive for mobile and desktop viewports.",
  "frontend/src/components/MapView.tsx": "Interactive canvas-based satellite map with Web Mercator projection, tile rendering, pan/zoom/pinch controls, GPS accuracy overlay, trail path visualization, and follow mode.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an actor instance for backend communication, automatically recreating it when the user's identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state, identity persistence, and authentication status throughout the React application.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook `useGeoInfo` that fetches geographic information from the backend actor with caching and retry logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a teal/cyan satellite-inspired color palette for both light and dark themes using OKLCH color space.",
  "frontend/src/lib/geo.ts": "Utility functions for Web Mercator projection calculations, converting between meters and pixels at different zoom levels and latitudes for GPS accuracy visualization.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH values, custom fonts, animations, and plugins for the igo GPS project.",
  "project_state.json": "Project metadata tracking architectural notes, features, and pending feature request AR-1 to expand satellite map to 90% width when clicked."
}