{
  "backend/main.mo": "Motoko backend actor providing HTTP outcall functions for external IP lookup, ping latency measurement, geolocation info retrieval, and download speed testing using multiple fallback API endpoints.",
  "feature_evidence.json": "Feature evidence report documenting PWA implementation including manifest file creation, service worker caching strategies, HTML meta tags, and app icon generation with high confidence test mappings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing GPS tracking app components, PWA configuration, service worker, styling, and geospatial utilities.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for a satellite-themed design system.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest link, apple-touch-icon, and mobile-web-app-capable settings for iOS and Android PWA support.",
  "frontend/public/manifest.json": "PWA manifest defining 'igo Satellite Tracker' app metadata with standalone display mode, theme colors, icon references (192x192, 512x512), and navigation shortcuts.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, network-first for API calls, automatic cache versioning, old cache cleanup, and skipWaiting for seamless updates.",
  "frontend/src/App.tsx": "Main React component managing GPS tracking with watchPosition, trail visualization using Haversine distance calculation, session state, and three-column responsive layout with expandable sidebars.",
  "frontend/src/components/CoordinateDisplay.tsx": "Displays GPS position data (latitude, longitude, accuracy), movement metrics (speed, heading), and total distance traveled in card components with quality badges and formatted units.",
  "frontend/src/components/DeviceInfoDialog.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Renders a footer with copyright notice and a link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Displays a sticky header with satellite icon, app title 'igo', and subtitle 'Satellite GPS Tracker'.",
  "frontend/src/components/MapView.tsx": "Interactive canvas-based map component that displays satellite tiles, GPS position with accuracy circle, trail path, and provides controls for tracking, zoom, pan, and auto-centering.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP login/logout, managing identity state, delegation validation, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hook that fetches geo info from the backend actor with caching and retry logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space and base styling for borders and typography.",
  "frontend/src/lib/geo.ts": "Utility functions for Web Mercator projection calculations including lat/lng to tile conversion, meters per pixel calculation, accuracy radius conversion, and optimal zoom level determination.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom color scheme with CSS variables, container settings, border radius tokens, custom fonts (Inter, JetBrains Mono), and animation keyframes for accordions.",
  "project_state.json": "Project state tracking file for 'igo Satellite Tracker' PWA with completed features for manifest, service worker, and HTML updates, plus pending features for service worker registration and error handling."
}