{
  "backend/main.mo": "Motoko actor providing HTTP outcall functions for external IP detection, ping latency measurement, geolocation info retrieval, and download speed testing using multiple fallback API endpoints.",
  "feature_evidence.json": "Feature evidence report documenting two features related to investigating and testing map zoom flickering issues in MapView.tsx, both with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing the app's geolocation tracking UI, map rendering with zoom stability improvements, coordinate displays, and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for the igo satellite tracking app design system.",
  "frontend/index.html": "HTML entry point with mobile-optimized meta tags, touch-friendly settings, and igo branding title for the location tracking app.",
  "frontend/src/App.tsx": "Main React component managing geolocation tracking state, trail recording, distance calculation, session management with mobile number input, and three-column expandable layout without forced map re-renders.",
  "frontend/src/components/CoordinateDisplay.tsx": "Responsive card-based component displaying GPS position, accuracy quality badges, movement metrics (speed/heading), and total distance traveled in a single-column stacked layout.",
  "frontend/src/components/DeviceInfoDialog.tsx": "Empty file placeholder for device information dialog component.",
  "frontend/src/components/Footer.tsx": "Footer component with dynamic year, heart icon, and UTM-tracked caffeine.ai attribution link using hostname as identifier.",
  "frontend/src/components/Header.tsx": "Sticky header with satellite icon, igo branding, and responsive design optimized for mobile and desktop viewports.",
  "frontend/src/components/MapView.tsx": "Interactive satellite map with Web Mercator projection, tile caching, zoom/pan controls, trail rendering, accuracy circles, and enhanced zoom stability through debounced rendering, ResizeObserver management, and concurrent render prevention to eliminate flickering.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an ICP backend actor with authentication, using React Query to cache the actor instance and invalidate dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider for ICP, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook to fetch geo information from the backend actor with caching, error handling, and retry logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color theme using OKLCH color space, defining light/dark mode variables for a teal/cyan satellite-inspired palette and utility classes.",
  "frontend/src/lib/geo.ts": "Utility functions for Web Mercator projection calculations including meters-per-pixel conversion, GPS accuracy visualization, and optimal tile zoom level determination for high-DPI displays.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH colors, container settings, font families, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata tracking a map zoom flickering issue as a known problem with two existing features focused on investigating/fixing the ResizeObserver-related flickering and testing zoom functionality."
}